about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>About</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/style.css" />
<link rel="stylesheet" href="/css/fonts.css" />
<link rel="icon" href="/images/favicon-32x32.png" />
<meta name="color-scheme" content="light dark" />
<meta http-equiv="Cache-Control" content="no-cache, no-store, must-revalidate">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Cascadia+Mono:ital,wght@0,200..700;1,200..700&family=Inter:ital,opsz,wght@0,14..32,100..900;1,14..32,100..900&display=swap" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<nav class="top-bar">
  <ol>
    <li class="nav-item"><a href="https://huntergreynolds.github.io/">Home</a>
    </li>
    <li class="nav-item"><a href="https://huntergreynolds.github.io/posts/">Posts</a>
    </li>
    <li class="nav-item"><a href="https://huntergreynolds.github.io/about.html">About</a>
    </li>
  </ol>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">About</h1>

<div id="outline-container-org791220c" class="outline-2">
<h2 id="org791220c">About Me</h2>
<div class="outline-text-2" id="text-org791220c">
<p>
I'm an IT tech/sysadmin. I like to poke at things and figure out how they work. I write code sometimes, and every once in a while it actually works.
</p>
</div>
</div>

<div id="outline-container-orgc98592e" class="outline-2">
<h2 id="orgc98592e">About This Site</h2>
<div class="outline-text-2" id="text-orgc98592e">
<p>
Right now, this is mostly a place for me to dump info as I tinker with making things for the GameBoy. Also, looking at what makes some of its games tick.
</p>

<p>
This site is created with GNU Emacs. I write the contents of the site in (mostly) org-mode, then use Org's publishing to do the rest. Check out <a href="https://systemcrafters.net/publishing-websites-with-org-mode/">the SystemCrafters guides</a> for more information on getting started.
</p>

<p>
Absolutely <b>no</b> AI was used in the making of anything on this site. All of the intelligence displayed here, and lack thereof, is my own.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
    &copy; Hunter Reynolds 2026 All posts and images on this website are being made available under the <a href="https://creativecommons.org/licenses/by/4.0/"> CC-BY 4.0 License </a>. Code snippets are made available under the <a href="https://opensource.org/license/mit">MIT License.</a>
</footer>
</div>
</body>
</html>
